/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S1 {
    pub c: S1__bindgen_ty_1,
    pub d: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S1__bindgen_ty_1 {
    pub a: ::std::os::raw::c_int,
    pub b: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S1__bindgen_ty_1"][::std::mem::size_of::<S1__bindgen_ty_1>() - 8usize];
    [
        "Alignment of S1__bindgen_ty_1",
    ][::std::mem::align_of::<S1__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: S1__bindgen_ty_1::a",
    ][::std::mem::offset_of!(S1__bindgen_ty_1, a) - 0usize];
    [
        "Offset of field: S1__bindgen_ty_1::b",
    ][::std::mem::offset_of!(S1__bindgen_ty_1, b) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S1"][::std::mem::size_of::<S1>() - 12usize];
    ["Alignment of S1"][::std::mem::align_of::<S1>() - 4usize];
    ["Offset of field: S1::c"][::std::mem::offset_of!(S1, c) - 0usize];
    ["Offset of field: S1::d"][::std::mem::offset_of!(S1, d) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S2 {
    pub inner: S2__bindgen_ty_1,
    pub d: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S2__bindgen_ty_1 {
    pub a: ::std::os::raw::c_int,
    pub deep: S2__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S2__bindgen_ty_1__bindgen_ty_1 {
    pub b: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of S2__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::size_of::<S2__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    [
        "Alignment of S2__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::align_of::<S2__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: S2__bindgen_ty_1__bindgen_ty_1::b",
    ][::std::mem::offset_of!(S2__bindgen_ty_1__bindgen_ty_1, b) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S2__bindgen_ty_1"][::std::mem::size_of::<S2__bindgen_ty_1>() - 8usize];
    [
        "Alignment of S2__bindgen_ty_1",
    ][::std::mem::align_of::<S2__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: S2__bindgen_ty_1::a",
    ][::std::mem::offset_of!(S2__bindgen_ty_1, a) - 0usize];
    [
        "Offset of field: S2__bindgen_ty_1::deep",
    ][::std::mem::offset_of!(S2__bindgen_ty_1, deep) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S2"][::std::mem::size_of::<S2>() - 12usize];
    ["Alignment of S2"][::std::mem::align_of::<S2>() - 4usize];
    ["Offset of field: S2::inner"][::std::mem::offset_of!(S2, inner) - 0usize];
    ["Offset of field: S2::d"][::std::mem::offset_of!(S2, d) - 8usize];
};
