/* automatically generated by rust-bindgen 0.70.1 */

/** Attributes

 See https://clang.llvm.org/docs/AttributeReference.html*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 16usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 0usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 4usize];
    [
        "Offset of field: __sFILE::_close",
    ][::std::mem::offset_of!(__sFILE, _close) - 8usize];
};
/** Attributes

 See https://clang.llvm.org/docs/AttributeReference.html*/
pub type FILE = __sFILE;
