/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct foo {
    pub c: ::std::os::raw::c_char,
    pub i: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of foo"][::std::mem::size_of::<foo>() - 5usize];
    ["Alignment of foo"][::std::mem::align_of::<foo>() - 1usize];
    ["Offset of field: foo::c"][::std::mem::offset_of!(foo, c) - 0usize];
    ["Offset of field: foo::i"][::std::mem::offset_of!(foo, i) - 1usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct bar {
    pub c: ::std::os::raw::c_char,
    pub i: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bar"][::std::mem::size_of::<bar>() - 5usize];
    ["Alignment of bar"][::std::mem::align_of::<bar>() - 1usize];
    ["Offset of field: bar::c"][::std::mem::offset_of!(bar, c) - 0usize];
    ["Offset of field: bar::i"][::std::mem::offset_of!(bar, i) - 1usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct baz {
    pub c: ::std::os::raw::c_char,
    pub i: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of baz"][::std::mem::size_of::<baz>() - 5usize];
    ["Alignment of baz"][::std::mem::align_of::<baz>() - 1usize];
    ["Offset of field: baz::c"][::std::mem::offset_of!(baz, c) - 0usize];
    ["Offset of field: baz::i"][::std::mem::offset_of!(baz, i) - 1usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct qux {
    pub c: ::std::os::raw::c_char,
    pub i: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of qux"][::std::mem::size_of::<qux>() - 5usize];
    ["Alignment of qux"][::std::mem::align_of::<qux>() - 1usize];
    ["Offset of field: qux::c"][::std::mem::offset_of!(qux, c) - 0usize];
    ["Offset of field: qux::i"][::std::mem::offset_of!(qux, i) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 16usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 0usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 4usize];
    [
        "Offset of field: __sFILE::_close",
    ][::std::mem::offset_of!(__sFILE, _close) - 8usize];
};
pub type FILE = __sFILE;
