/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b {
    pub toA: *mut a,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b"][::std::mem::size_of::<b>() - 8usize];
    ["Alignment of b"][::std::mem::align_of::<b>() - 8usize];
    ["Offset of field: b::toA"][::std::mem::offset_of!(b, toA) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct a {
    pub toB: b,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of a"][::std::mem::size_of::<a>() - 8usize];
    ["Alignment of a"][::std::mem::align_of::<a>() - 8usize];
    ["Offset of field: a::toB"][::std::mem::offset_of!(a, toB) - 0usize];
};
