/* automatically generated by rust-bindgen 0.70.1 */

pub type S1_t = S1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S1 {
    pub a: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S1"][::std::mem::size_of::<S1>() - 4usize];
    ["Alignment of S1"][::std::mem::align_of::<S1>() - 4usize];
    ["Offset of field: S1::a"][::std::mem::offset_of!(S1, a) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S2 {
    pub a: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of S2"][::std::mem::size_of::<S2>() - 4usize];
    ["Alignment of S2"][::std::mem::align_of::<S2>() - 4usize];
    ["Offset of field: S2::a"][::std::mem::offset_of!(S2, a) - 0usize];
};
