/* automatically generated by rust-bindgen 0.70.1 */

extern "C" {
    /// Global variables
    pub static mut simpleGlobal: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct config {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of config"][::std::mem::size_of::<config>() - 8usize];
    ["Alignment of config"][::std::mem::align_of::<config>() - 4usize];
    ["Offset of field: config::x"][::std::mem::offset_of!(config, x) - 0usize];
    ["Offset of field: config::y"][::std::mem::offset_of!(config, y) - 4usize];
};
extern "C" {
    pub static mut compoundGlobal1: config;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct inline_struct {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of inline_struct"][::std::mem::size_of::<inline_struct>() - 8usize];
    ["Alignment of inline_struct"][::std::mem::align_of::<inline_struct>() - 4usize];
    [
        "Offset of field: inline_struct::x",
    ][::std::mem::offset_of!(inline_struct, x) - 0usize];
    [
        "Offset of field: inline_struct::y",
    ][::std::mem::offset_of!(inline_struct, y) - 4usize];
};
extern "C" {
    pub static mut compoundGlobal2: inline_struct;
}
/** Non-extern non-static global variables

 These kinds of variables need to be treated with care, to avoid duplicate
 symbols, but do exist in the wild. The `streamBinary` example is an extract
 from a driver [1], which not only declares a non-extern non-static global,
 but does not even use @pragma once@ or similar.

 We test with various kinds of initializers as we must explicitly ignore them
 in our parser. The list here roughly follows the definition of `CXCursor`
 [2], starting at `CXCursor_IntegerLiteral`; see also definition of 'varDecl'
 in `HsBindgen.Frontend.Pass.Parse.Decl`.

 [1]: https://github.com/analogdevicesinc/no-OS/blob/main/drivers/rf-transceiver/talise/firmware/talise_stream_binary.h
 [2]: https://clang.llvm.org/doxygen/group__CINDEX.html#gaaccc432245b4cd9f2d470913f9ef0013*/
pub const nesInteger: ::std::os::raw::c_int = 1;
pub const nesFloating: f32 = 1.2000000476837158;
pub const nesString1: &[u8; 3] = b"hi\0";
pub const nesString2: &[u8; 3] = b"hi\0";
pub const nesCharacter: ::std::os::raw::c_char = 97;
pub const nesParen: ::std::os::raw::c_int = 1;
pub const nesUnary: ::std::os::raw::c_int = 5;
pub const nesBinary: ::std::os::raw::c_int = 3;
pub const nesConditional: ::std::os::raw::c_int = 2;
pub const nesCast: f32 = 1.0;
extern "C" {
    pub static mut nesCompound: *mut ::std::os::raw::c_int;
}
extern "C" {
    pub static mut nesInitList: [u8; 4usize];
}
/** Error cases

 NOTE: We test the error for thread_local separately (as it requires C23).*/
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_ty_1 {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_ty_1"][::std::mem::size_of::<_bindgen_ty_1>() - 8usize];
    ["Alignment of _bindgen_ty_1"][::std::mem::align_of::<_bindgen_ty_1>() - 4usize];
    [
        "Offset of field: _bindgen_ty_1::x",
    ][::std::mem::offset_of!(_bindgen_ty_1, x) - 0usize];
    [
        "Offset of field: _bindgen_ty_1::y",
    ][::std::mem::offset_of!(_bindgen_ty_1, y) - 4usize];
};
extern "C" {
    pub static mut unusableAnon: _bindgen_ty_1;
}
