/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Copy, Clone)]
pub struct exA {
    pub fieldA1: exA_unionA,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union exA_unionA {
    pub a: ::std::os::raw::c_int,
    pub b: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exA_unionA"][::std::mem::size_of::<exA_unionA>() - 4usize];
    ["Alignment of exA_unionA"][::std::mem::align_of::<exA_unionA>() - 4usize];
    ["Offset of field: exA_unionA::a"][::std::mem::offset_of!(exA_unionA, a) - 0usize];
    ["Offset of field: exA_unionA::b"][::std::mem::offset_of!(exA_unionA, b) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exA"][::std::mem::size_of::<exA>() - 4usize];
    ["Alignment of exA"][::std::mem::align_of::<exA>() - 4usize];
    ["Offset of field: exA::fieldA1"][::std::mem::offset_of!(exA, fieldA1) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct exB {
    pub fieldB1: exB__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union exB__bindgen_ty_1 {
    pub a: ::std::os::raw::c_int,
    pub b: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exB__bindgen_ty_1"][::std::mem::size_of::<exB__bindgen_ty_1>() - 4usize];
    [
        "Alignment of exB__bindgen_ty_1",
    ][::std::mem::align_of::<exB__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: exB__bindgen_ty_1::a",
    ][::std::mem::offset_of!(exB__bindgen_ty_1, a) - 0usize];
    [
        "Offset of field: exB__bindgen_ty_1::b",
    ][::std::mem::offset_of!(exB__bindgen_ty_1, b) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of exB"][::std::mem::size_of::<exB>() - 4usize];
    ["Alignment of exB"][::std::mem::align_of::<exB>() - 4usize];
    ["Offset of field: exB::fieldB1"][::std::mem::offset_of!(exB, fieldB1) - 0usize];
};
