/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct foo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bar {
    pub ptrA: *mut foo,
    pub ptrB: *mut bar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bar"][::std::mem::size_of::<bar>() - 16usize];
    ["Alignment of bar"][::std::mem::align_of::<bar>() - 8usize];
    ["Offset of field: bar::ptrA"][::std::mem::offset_of!(bar, ptrA) - 0usize];
    ["Offset of field: bar::ptrB"][::std::mem::offset_of!(bar, ptrB) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct baz {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of baz"][::std::mem::size_of::<baz>() - 0usize];
    ["Alignment of baz"][::std::mem::align_of::<baz>() - 1usize];
};
pub type quu = i32;
