/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Baz {
    pub x: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Baz"][::std::mem::size_of::<Baz>() - 4usize];
    ["Alignment of Baz"][::std::mem::align_of::<Baz>() - 4usize];
    ["Offset of field: Baz::x"][::std::mem::offset_of!(Baz, x) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct Foo {
    pub x: u128,
    pub y: Baz,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Foo"][::std::mem::size_of::<Foo>() - 32usize];
    ["Alignment of Foo"][::std::mem::align_of::<Foo>() - 16usize];
    ["Offset of field: Foo::x"][::std::mem::offset_of!(Foo, x) - 0usize];
    ["Offset of field: Foo::y"][::std::mem::offset_of!(Foo, y) - 16usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct BarByValue {
    pub x: Foo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BarByValue"][::std::mem::size_of::<BarByValue>() - 32usize];
    ["Alignment of BarByValue"][::std::mem::align_of::<BarByValue>() - 16usize];
    ["Offset of field: BarByValue::x"][::std::mem::offset_of!(BarByValue, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BarByReference {
    pub x: *mut Foo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BarByReference"][::std::mem::size_of::<BarByReference>() - 8usize];
    ["Alignment of BarByReference"][::std::mem::align_of::<BarByReference>() - 8usize];
    [
        "Offset of field: BarByReference::x",
    ][::std::mem::offset_of!(BarByReference, x) - 0usize];
};
