/* automatically generated by rust-bindgen 0.71.1 */

unsafe extern "C" {
    pub fn fun1(arg1: u128);
}
unsafe extern "C" {
    pub fn fun2(arg1: ::std::os::raw::c_int);
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct struct1 {
    pub x: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of struct1"][::std::mem::size_of::<struct1>() - 16usize];
    ["Alignment of struct1"][::std::mem::align_of::<struct1>() - 16usize];
    ["Offset of field: struct1::x"][::std::mem::offset_of!(struct1, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct struct2 {
    pub x: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of struct2"][::std::mem::size_of::<struct2>() - 4usize];
    ["Alignment of struct2"][::std::mem::align_of::<struct2>() - 4usize];
    ["Offset of field: struct2::x"][::std::mem::offset_of!(struct2, x) - 0usize];
};
