/* automatically generated by rust-bindgen 0.71.1 */

/// Examples from the initial specification
pub type int16_T = ::std::os::raw::c_short;
pub type int32_T = ::std::os::raw::c_int;
pub type int64_T = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cint16_T {
    pub re: int16_T,
    pub im: int16_T,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cint16_T"][::std::mem::size_of::<cint16_T>() - 4usize];
    ["Alignment of cint16_T"][::std::mem::align_of::<cint16_T>() - 2usize];
    ["Offset of field: cint16_T::re"][::std::mem::offset_of!(cint16_T, re) - 0usize];
    ["Offset of field: cint16_T::im"][::std::mem::offset_of!(cint16_T, im) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct B {}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of B"][::std::mem::size_of::<B>() - 0usize];
    ["Alignment of B"][::std::mem::align_of::<B>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct A {
    pub x: f64,
    pub label: *mut ::std::os::raw::c_char,
    pub samples: [::std::os::raw::c_char; 128usize],
    pub b: B,
    pub c: *mut C,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of A"][::std::mem::size_of::<A>() - 152usize];
    ["Alignment of A"][::std::mem::align_of::<A>() - 8usize];
    ["Offset of field: A::x"][::std::mem::offset_of!(A, x) - 0usize];
    ["Offset of field: A::label"][::std::mem::offset_of!(A, label) - 8usize];
    ["Offset of field: A::samples"][::std::mem::offset_of!(A, samples) - 16usize];
    ["Offset of field: A::b"][::std::mem::offset_of!(A, b) - 144usize];
    ["Offset of field: A::c"][::std::mem::offset_of!(A, c) - 144usize];
};
unsafe extern "C" {
    pub fn resample(
        res_m_num_valid_samples: *mut int32_T,
        res_m_iq_int: *mut cint16_T,
        res_m_old_rate: int64_T,
        res_m_new_rate: int64_T,
        res_m_iq_resampled_int: *mut cint16_T,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct C {
    pub _address: u8,
}
