/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct foo {
    pub z: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct foo_bar {
    pub x: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of foo_bar"][::std::mem::size_of::<foo_bar>() - 4usize];
    ["Alignment of foo_bar"][::std::mem::align_of::<foo_bar>() - 4usize];
    ["Offset of field: foo_bar::x"][::std::mem::offset_of!(foo_bar, x) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of foo"][::std::mem::size_of::<foo>() - 4usize];
    ["Alignment of foo"][::std::mem::align_of::<foo>() - 4usize];
    ["Offset of field: foo::z"][::std::mem::offset_of!(foo, z) - 0usize];
};
extern "C" {
    pub fn func(arg: *mut foo_bar);
}
