/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OkBefore {
    pub x: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OkBefore"][::std::mem::size_of::<OkBefore>() - 4usize];
    ["Alignment of OkBefore"][::std::mem::align_of::<OkBefore>() - 4usize];
    ["Offset of field: OkBefore::x"][::std::mem::offset_of!(OkBefore, x) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct Fail {
    pub x: u128,
    pub y: OkBefore,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Fail"][::std::mem::size_of::<Fail>() - 32usize];
    ["Alignment of Fail"][::std::mem::align_of::<Fail>() - 16usize];
    ["Offset of field: Fail::x"][::std::mem::offset_of!(Fail, x) - 0usize];
    ["Offset of field: Fail::y"][::std::mem::offset_of!(Fail, y) - 16usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct DependOnFailByValue {
    pub x: Fail,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of DependOnFailByValue",
    ][::std::mem::size_of::<DependOnFailByValue>() - 32usize];
    [
        "Alignment of DependOnFailByValue",
    ][::std::mem::align_of::<DependOnFailByValue>() - 16usize];
    [
        "Offset of field: DependOnFailByValue::x",
    ][::std::mem::offset_of!(DependOnFailByValue, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DependOnFailByReference {
    pub x: *mut Fail,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of DependOnFailByReference",
    ][::std::mem::size_of::<DependOnFailByReference>() - 8usize];
    [
        "Alignment of DependOnFailByReference",
    ][::std::mem::align_of::<DependOnFailByReference>() - 8usize];
    [
        "Offset of field: DependOnFailByReference::x",
    ][::std::mem::offset_of!(DependOnFailByReference, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OkAfter {
    pub x: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OkAfter"][::std::mem::size_of::<OkAfter>() - 4usize];
    ["Alignment of OkAfter"][::std::mem::align_of::<OkAfter>() - 4usize];
    ["Offset of field: OkAfter::x"][::std::mem::offset_of!(OkAfter, x) - 0usize];
};
