/* automatically generated by rust-bindgen 0.71.1 */

unsafe extern "C" {
    pub static mut x: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut n: ::std::os::raw::c_int;
}
pub type int_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct X {
    pub n: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of X"][::std::mem::size_of::<X>() - 4usize];
    ["Alignment of X"][::std::mem::align_of::<X>() - 4usize];
    ["Offset of field: X::n"][::std::mem::offset_of!(X, n) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct y {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union Y {
    pub m: ::std::os::raw::c_int,
    pub o: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Y"][::std::mem::size_of::<Y>() - 4usize];
    ["Alignment of Y"][::std::mem::align_of::<Y>() - 4usize];
    ["Offset of field: Y::m"][::std::mem::offset_of!(Y, m) - 0usize];
    ["Offset of field: Y::o"][::std::mem::offset_of!(Y, o) - 0usize];
};
