/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct primitive {
    pub c: ::std::os::raw::c_char,
    pub sc: ::std::os::raw::c_schar,
    pub uc: ::std::os::raw::c_uchar,
    pub s: ::std::os::raw::c_short,
    pub si: ::std::os::raw::c_short,
    pub ss: ::std::os::raw::c_short,
    pub ssi: ::std::os::raw::c_short,
    pub us: ::std::os::raw::c_ushort,
    pub usi: ::std::os::raw::c_ushort,
    pub i: ::std::os::raw::c_int,
    pub s2: ::std::os::raw::c_int,
    pub si2: ::std::os::raw::c_int,
    pub u: ::std::os::raw::c_uint,
    pub ui: ::std::os::raw::c_uint,
    pub l: ::std::os::raw::c_long,
    pub li: ::std::os::raw::c_long,
    pub sl: ::std::os::raw::c_long,
    pub sli: ::std::os::raw::c_long,
    pub ul: ::std::os::raw::c_ulong,
    pub uli: ::std::os::raw::c_ulong,
    pub ll: ::std::os::raw::c_longlong,
    pub lli: ::std::os::raw::c_longlong,
    pub sll: ::std::os::raw::c_longlong,
    pub slli: ::std::os::raw::c_longlong,
    pub ull: ::std::os::raw::c_ulonglong,
    pub ulli: ::std::os::raw::c_ulonglong,
    pub f: f32,
    pub d: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of primitive"][::std::mem::size_of::<primitive>() - 152usize];
    ["Alignment of primitive"][::std::mem::align_of::<primitive>() - 8usize];
    ["Offset of field: primitive::c"][::std::mem::offset_of!(primitive, c) - 0usize];
    ["Offset of field: primitive::sc"][::std::mem::offset_of!(primitive, sc) - 1usize];
    ["Offset of field: primitive::uc"][::std::mem::offset_of!(primitive, uc) - 2usize];
    ["Offset of field: primitive::s"][::std::mem::offset_of!(primitive, s) - 4usize];
    ["Offset of field: primitive::si"][::std::mem::offset_of!(primitive, si) - 6usize];
    ["Offset of field: primitive::ss"][::std::mem::offset_of!(primitive, ss) - 8usize];
    [
        "Offset of field: primitive::ssi",
    ][::std::mem::offset_of!(primitive, ssi) - 10usize];
    ["Offset of field: primitive::us"][::std::mem::offset_of!(primitive, us) - 12usize];
    [
        "Offset of field: primitive::usi",
    ][::std::mem::offset_of!(primitive, usi) - 14usize];
    ["Offset of field: primitive::i"][::std::mem::offset_of!(primitive, i) - 16usize];
    ["Offset of field: primitive::s2"][::std::mem::offset_of!(primitive, s2) - 20usize];
    [
        "Offset of field: primitive::si2",
    ][::std::mem::offset_of!(primitive, si2) - 24usize];
    ["Offset of field: primitive::u"][::std::mem::offset_of!(primitive, u) - 28usize];
    ["Offset of field: primitive::ui"][::std::mem::offset_of!(primitive, ui) - 32usize];
    ["Offset of field: primitive::l"][::std::mem::offset_of!(primitive, l) - 40usize];
    ["Offset of field: primitive::li"][::std::mem::offset_of!(primitive, li) - 48usize];
    ["Offset of field: primitive::sl"][::std::mem::offset_of!(primitive, sl) - 56usize];
    [
        "Offset of field: primitive::sli",
    ][::std::mem::offset_of!(primitive, sli) - 64usize];
    ["Offset of field: primitive::ul"][::std::mem::offset_of!(primitive, ul) - 72usize];
    [
        "Offset of field: primitive::uli",
    ][::std::mem::offset_of!(primitive, uli) - 80usize];
    ["Offset of field: primitive::ll"][::std::mem::offset_of!(primitive, ll) - 88usize];
    [
        "Offset of field: primitive::lli",
    ][::std::mem::offset_of!(primitive, lli) - 96usize];
    [
        "Offset of field: primitive::sll",
    ][::std::mem::offset_of!(primitive, sll) - 104usize];
    [
        "Offset of field: primitive::slli",
    ][::std::mem::offset_of!(primitive, slli) - 112usize];
    [
        "Offset of field: primitive::ull",
    ][::std::mem::offset_of!(primitive, ull) - 120usize];
    [
        "Offset of field: primitive::ulli",
    ][::std::mem::offset_of!(primitive, ulli) - 128usize];
    ["Offset of field: primitive::f"][::std::mem::offset_of!(primitive, f) - 136usize];
    ["Offset of field: primitive::d"][::std::mem::offset_of!(primitive, d) - 144usize];
};
